JackABK/SmartEPW_Server_STM32F407/Smart_EPW_lib/EPW_behavior.c
/*============================================================================*/
/*============================================================================*
 ** function : parse_EPW_motor_dir
 ** brief : parse the EPW of motor direction from the uart siganl,
            note, the motor_pwm_value  max is 255, even if 256, it's duty cycle is equal to 255.
 ** param : DIR_cmd
 ** retval :  None
 **============================================================================*/
/*============================================================================*/
void parse_EPW_motor_dir(unsigned char DIR_cmd)
{
		if(DIR_cmd == 'f'){
				encoder_left_counter=0;
				encoder_right_counter=0;
                motor_speed_convert_to_pwm(MOTOR_CW, motor_speed_value); 
				pwm_value_left = 150;
				pwm_value_right=pwm_value_left;
				proc_cmd("forward" , pwm_value_left , pwm_value_right);
                car_state = CAR_STATE_MOVE_FORWARD;
		}
		else if(DIR_cmd == 's'){
				car_state = CAR_STATE_IDLE;
				encoder_left_counter=0;
				encoder_right_counter=0;
				/*even stop function is  always zero , but for security, I also set speedvalue to zero.*/
				pwm_value_left = 125;
				pwm_value_right = 125;
				proc_cmd("stop" , pwm_value_left , pwm_value_right);

		}
		else if(DIR_cmd == 'b'){
                car_state = CAR_STATE_MOVE_BACK;
				encoder_left_counter=0;
				encoder_right_counter=0;
                motor_speed_convert_to_pwm(MOTOR_CCW, motor_speed_value); 
				pwm_value_left = 100;
				pwm_value_right=pwm_value_left;
				proc_cmd("backward" , pwm_value_left , pwm_value_right);
		}
        else if(DIR_cmd == 'l'){
                car_state = CAR_STATE_MOVE_LEFT;
				encoder_left_counter=0;
				encoder_right_counter=0;
				pwm_value_left = 100; 
				pwm_value_right= 150; 
				proc_cmd("left" , pwm_value_left , pwm_value_right);
		}
        else if(DIR_cmd == 'r'){
                car_state = CAR_STATE_MOVE_RIGHT;
				encoder_left_counter=0;
				encoder_right_counter=0;
				pwm_value_left = 150; 
				pwm_value_right=100;
				proc_cmd("right" , pwm_value_left , pwm_value_right);
		}
		else{
				/*do not anything*/
		}
}


/*============================================================================*/
/*============================================================================*
 ** function : motor_speed_convert_to_pwm
 ** brief : convert the motor speed value to pwm value based on motor driver.
 **         motor speed value range is 1~10,
 **         convert the pwm value by 
 **           CW : 146~222 
 **           CCW : 32~108 
 **         1 speed value convert to 8 pwm scale.
 ** param : motor_dir, speed_value
 ** retval : pwm value
 **============================================================================*/
/*============================================================================*/
int motor_speed_convert_to_pwm(int motor_dir, int speed_value){
    static int pwm_value;
    switch(motor_dir){
        case MOTOR_CW: /*pwm range: 146~222*/
            pwm_value = 146 + speed_value*8;
            break;
        case MOTOR_CCW: /*pwm range: 32~108*/
            pwm_value = 108 - speed_value*8;
            break;
    }
    return pwm_value;
    
}


void PerformCommand(unsigned char group,unsigned char control_id, unsigned char value)
{
   static int actuator_pwm_value=0;
   if(group == OUT_EPW_CMD){ /*0*/
		switch ( control_id )
		{
		    case EPW_MOTOR_DIR:
		        parse_EPW_motor_dir(value);
		        break;
		    case EPW_MOTOR_PWM:
		        motor_speed_value = value; /*0~10 scale*/
		        break;
		    case EPW_ACTUATOR_A :
                //if(value==LINEAR_ACTU_CW) actuator_pwm_value=255;
                //else if(value==LINEAR_ACTU_CCW) actuator_pwm_value=150;
		        set_linearActuator_A_cmd(value , actuator_pwm_value); /*the actuator of pwm_value is fixed, value is dir flag.*/
		        break;
		    case EPW_ACTUATOR_B :   
                //if(value==LINEAR_ACTU_CW) actuator_pwm_value=255;
                //else if(value==LINEAR_ACTU_CCW) actuator_pwm_value=150;
		        set_linearActuator_B_cmd(value , actuator_pwm_value); /*the actuator of pwm_value is fixed. value is dir flag.*/
		        break;
		    case EPW_PID_ALG_KP :
                 Kp = (float)value / 10.0f;                 
		         InitPID(&PID_Motor_L , Kp, Ki,Kd);
		         InitPID(&PID_Motor_R , Kp, Ki,Kd);
		        break;
		    case EPW_PID_ALG_KI :
                 Ki = (float)value / 10.0f;                 
		         InitPID(&PID_Motor_L , Kp, Ki, Kd);
		         InitPID(&PID_Motor_R , Kp, Ki, Kd);
		        break;
            case EPW_PID_ALG_KD :
                 Kd = (float)value / 10.0f;                 
		         InitPID(&PID_Motor_L, Kp, Ki, Kd);
		         InitPID(&PID_Motor_R, Kp, Ki, Kd);
		        break;
		    default:
		        ;
		}
   }
}



/*============================================================================*/
/*============================================================================*
 ** function : PID_Algorithm_Polling
 ** brief : loop read the encoder signal  and caclulator the RPM , the cycle time is 20msec
 ** param : None
 ** retval : None
 **============================================================================*/
/*============================================================================*/
#define OUTPUT_INFO_PERIOD 25 /*unit : PID_POLLING_PERIOD ms*/
void PID_Algorithm_Polling(void)
{

		detachInterrupt(EXTI_Line0); /*close external interrupt 0*/ 
		detachInterrupt(EXTI_Line1); /*close external interrupt 1*/ 
        float temp ;
        /*get the two motor parameter such as RPM, Rotations..*/
        getMotorData();


#if 0
		/*restart motor calibration and re-count encoder count*/
		if(car_state == CAR_STATE_MOVE_FORWARD){
                /*the motor of encoder is not detect. so can't running PID alg.*/
                if(encoder_left_counter==0&&encoder_right_counter==0){
                        ;//proc_cmd("stop" , 127 , 127);
                }else{/*detected encoder data, start to PID alg.*/
                        /*calculate Position PID of two motor*/    
                        pwm_value_left = (int)PID_Pos_Calc(&PID_Motor_L , set_rpm , rpm_left_motor);
                        pwm_value_right = (int)PID_Pos_Calc(&PID_Motor_R , set_rpm , rpm_right_motor);
                }
				proc_cmd("forward" , pwm_value_left , pwm_value_right);

                 if(encoder_left_counter_sum>=motor_speed_value*0.9*500 || encoder_right_counter_sum>=motor_speed_value*0.9*500){
                    car_state = CAR_STATE_REST;
                    encoder_left_counter_sum=0;
                    encoder_right_counter_sum=0;
                }
		}
		else if(car_state == CAR_STATE_MOVE_BACK) {
                /*the motor of encoder is not detect. so can't running PID alg.*/
                if(encoder_left_counter==0&&encoder_right_counter==0){
                        ;//proc_cmd("stop" , 127 , 127);
                }else{/*detected encoder data, start to PID alg.*/
                        /*calculate Position PID of two motor*/    
                        pwm_value_left_err =(int)PID_Pos_Calc(&PID_Motor_L , set_rpm , rpm_left_motor) - pwm_value_left;
                        pwm_value_right_err =(int)PID_Pos_Calc(&PID_Motor_R , set_rpm , rpm_right_motor) - pwm_value_right;
                        if(pwm_value_left_err<=0)pwm_value_left_err=-pwm_value_left_err;
                        if(pwm_value_right_err<=0)pwm_value_right_err=-pwm_value_right_err;
                }
                /*for the backward of motor driver, decrease pwm vaue means more fast.*/
				proc_cmd("backward" , pwm_value_left-pwm_value_left_err , pwm_value_right-pwm_value_right_err);

                if(encoder_left_counter_sum>=motor_speed_value*0.9*500 || encoder_right_counter_sum>=motor_speed_value*0.9*500){
                    car_state = CAR_STATE_REST;
                    encoder_left_counter_sum=0;
                    encoder_right_counter_sum=0;
                }
		}
#endif
#if 0
        if(record_data_to_sdio == 50){
                   access_data_to_sdio();
                   record_data_to_sdio=0;
               }else{
                   record_data_to_sdio++;
               }
#endif

               
        //access_data_to_sdio();

