JackABK/SmartEPW_Server_STM32F407/Smart_EPW_lib/EPW_behavior.c
        encoder_left_counter = 0;   
        encoder_right_counter = 0; 

		/*restart enable the external interrupt*/
		attachInterrupt(EXTI_Line0); 
		attachInterrupt(EXTI_Line1);

}

void getMotorData(void)
{
    /*for L298N test is used by 600 pulse/rev of the encoder.*/
#ifdef L298N_MODE 
    rpm_left_motor=(float)encoder_left_counter * 60.0f /600.0f / 0.02f;
    rpm_right_motor=(float)encoder_right_counter * 60.0f  /600.0f / 0.02f;    
#else
    /*for SmartEPW is used by 500 pulse/rev */
    rpm_left_motor=(float)encoder_left_counter * (2.0f/3.0f)* 60.0f /500.0f / 0.02f;
    rpm_right_motor=(float)encoder_right_counter * (2.0f/3.0f) * 60.0f /500.0f / 0.02f;          
    //get the speed of the two motors in deg/sec
    /***do someting***/ 
#endif
}

void accsess_sdio_setup()
{
    // Initialise media
    media_init();

    // Initialise File IO Library
    fl_init();

    // Attach media access functions to library
    if (fl_attach_media(media_read, media_write) != FAT_INIT_OK)
    {
        printf("ERROR: Media attach failed\n");
        return; 
    }
    // List root directory
    fl_listdirectory("/");
   
    // Close file
    //fl_fclose(file);
    
    // Delete File
    //if (fl_remove("/file.bin") < 0)
    //printf("ERROR: Delete file failed\n");

    // List root directory
    //fl_listdirectory("/");

    //fl_shutdown();
}
void access_data_to_sdio(){
    static unsigned char index[1];
    static char Kp_str[4];
    static char Ki_str[4];
    static char Kd_str[4];
    static char encoder_left_cnt_str[4];
    static char encoder_right_cnt_str[4];
    static char rpm_left_str[4];
    static char rpm_right_str[4];
  
    int2str((int)(Kp*10.0f), Kp_str);
    int2str((int)(Ki*10.0f), Ki_str);
    int2str((int)(Kd*10.0f), Kd_str);
    int2str((int)(encoder_left_counter), encoder_left_cnt_str);
    int2str((int)(encoder_right_counter), encoder_right_cnt_str);
    int2str((int)(rpm_left_motor*10.0f), rpm_left_str);
    int2str((int)(rpm_right_motor*10.0f), rpm_right_str);
   
     // Create File
    file = fl_fopen("/PID.txt", "w");
    if (file)
    {
        printf("success to open the file\n");
    }
    else
        printf("ERROR: Create file failed\n");

    fl_fseek(file,0,SEEK_END);
    //fl_fread(index,1,sizeof(unsigned char),file);

    fl_fputs(Kp_str,file);
    fl_fputs("\t",file);
    fl_fputs(Ki_str,file);
    fl_fputs("\t",file);
    fl_fputs(Kd_str,file);
    fl_fputs("\t",file);
    fl_fputs(encoder_left_cnt_str,file);
    fl_fputs("\t",file);
    fl_fputs(encoder_right_cnt_str,file);
    fl_fputs("\t",file);
    fl_fputs(rpm_left_str,file);
    fl_fputs("\t",file);
    fl_fputs(rpm_right_str,file);
    fl_fputs("\t",file);
    fl_fputs("\n",file);

    // Close file
    fl_fclose(file);
}
void EXTI0_IRQHandler(){

		if(EXTI_GetITStatus(EXTI_Line0) != RESET)
		{
                encoder_left_counter_sum++; 
				encoder_left_counter++ ;
				EXTI_ClearITPendingBit(EXTI_Line0);
		}
}

void EXTI1_IRQHandler(){
		if(EXTI_GetITStatus(EXTI_Line1) != RESET)
		{
            
                encoder_right_counter_sum++; 
				encoder_right_counter++ ;
				EXTI_ClearITPendingBit(EXTI_Line1);
		}
}


void detachInterrupt(uint32_t EXTI_LineX){
		EXTI_InitTypeDef EXTI_InitStruct;
		EXTI_InitStruct.EXTI_Line = EXTI_LineX;
		EXTI_InitStruct.EXTI_LineCmd = DISABLE;
}

void attachInterrupt(uint32_t EXTI_LineX){
		EXTI_InitTypeDef EXTI_InitStruct;
		EXTI_InitStruct.EXTI_Line = EXTI_LineX;
		EXTI_InitStruct.EXTI_LineCmd = ENABLE;
}
